КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул2/КонтурЛогистика_ТрН_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительСтрока</name>
    <comment>kl-driver из customData</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтметкиПеревозчика</name>
    <comment>есть ли в титуле элемент ОтметПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЗамечанияПеревозчика</name>
    <comment>есть ли в титуле элемент ЗамПрвПрием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфПрвПрием</name>
    <comment>Дата формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПрвПрием</name>
    <comment>Время формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфГО</name>
    <comment>Дата формирования файла обмена информации грузоотправителя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфГО</name>
    <comment>Время формирования файла обмена информации грузоотправителя</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфГО</name>
    <comment>Идентификатор файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомИспрГО</name>
    <comment>Номер исправоления титула 1</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспрГО</name>
    <comment>Дата исправления титула 1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПГО</name>
    <comment>Электронная подпись файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПриб</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрУбыт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамДатВрПосПрием</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамСостГруз</name>
    <comment>Оговорки и замечания в отношении фактического состояния груза, креплении груза, тары, упаковки, маркировки и опломбирования</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамМасс</name>
    <comment>Оговорки и замечания в отношении фактического состояния груза, креплении груза, тары, упаковки, маркировки и опломбирования¶Оговорки и замечания в отношении массы груза</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамКолМест</name>
    <comment>Оговорки и замечания в отношении количества грузовых мест</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамПогрРаб</name>
    <comment>Оговорки и замечания в отношении проведения погрузочных работ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОбОтказеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиПеревозчика</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтмАктВзв</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамечанияИнфПол</name>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОсобенностиДокументооборота/КонтурЛогистика_ОсобенностиДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ОсобенностиДокументооборота</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Особенность</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОсобенностейДокументооборота</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КаналыТранспорта/КонтурЛогистика_КаналыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КаналыТранспорта</name>
  <comment>Диадок, API сервиса логистики, другие каналы</comment>
  <enumValues>
    <name>Диадок</name>
  </enumValues>
  <enumValues>
    <name>API_КонтурЛогистика</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул2/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка) И НомИспрГО <> 0 Тогда
		// Пометим на удаление предыдущий титул
		ФалыйДляУдаления = Новый Массив;
		
		Титулы2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитулыГлавногоПоТипу(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, ДокументЭТРН);
		Для Каждого ТекущийТитул Из Титулы2 Цикл
			ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ТекущийТитул);
			
			Если ЗначениеЗаполнено(ФайлТитула) Тогда
				ФалыйДляУдаления.Добавить(ФайлТитула);
			КонецЕсли;
		КонецЦикла;
		
		КонтурЛогистика_ОбработкаДокументовСервер.УдалитьФайлыИСвязныеОбъекты(ФалыйДляУдаления);
	КонецЕсли;
	
	// Уведомления об отказе
	Если Не Отказ
		И ЕстьОтказВПодписи
		И Не УведомлениеОбОтказеОтправлено Тогда
		
		УведомлениеОбОтказеОтправлено = КонтурЛогистика_Уведомления.ОтправитьУведомленияОбОтказеИлиЧастичнойПриемкеТрН(ЭтотОбъект);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул2_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		// TODO
		//ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		//ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
		// Сброс особенностей
		НомерДатаИсправленияТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НомерДатаИсправленияПоИмениФайла(ИдФайлИнфГО);
		Если НомИспрГО >= НомерДатаИсправленияТ1.НомИспр Тогда
			Особенность = Перечисления.КонтурЛогистика_ТипыОсобенностейДокументооборота.ПустаяСсылка();
			РегистрыСведений.КонтурЛогистика_ОсобенностиДокументооборота.УстановитьОсобенность(ДокументЭТРН, Особенность);
		КонецЕсли;
		
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул2_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если Найти(XDTO.ИдФайл, "DP_UVUTOCH") = 0 И Найти(XDTO.ИдФайл, "DP_UNISOOBSCH") = 0 Тогда 
			
			ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
			
		Иначе
			
			ЗаполнитьРеквизитыТитулаИзXDTOОтказ(XDTO);
			
		КонецЕсли;
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	СодИнфПрвПрием 	= КС.XDTO_Вычислить(XDTO, "Документ.СодИнфПрвПрием");
	ОтметПрв 		= КС.XDTO_Вычислить(СодИнфПрвПрием, "ОтметПрвПрием");
	
	ДатИнфПрвПрием 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфПрвПрием"));
	ВрИнфПрвПрием 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфПрвПрием"));
	
	ДатФайлИнфГО 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГО.ДатФайлИнфГО"));
	ВрФайлИнфГО 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГО.ВрФайлИнфГО"));
	ИдФайлИнфГО 	= КС.XDTO_Вычислить(Документ, "ИдИнфГО.ИдФайлИнфГО");
	
	Если ЗначениеЗаполнено(ИдФайлИнфГО) Тогда
		НомерДатаИсправления = КонтурЛогистика_ОбработкаДокументовСервер.НомерДатаИсправленияПоИмениФайла(ИдФайлИнфГО);
		НомИспрГО = НомерДатаИсправления.НомИспр;
		ДатаИспрГО = НомерДатаИсправления.ДатаИспр;
	КонецЕсли;
	
	ЭПГО = КС.XDTO_Вычислить(Документ, "ИдИнфГО.ЭП");
	
	СтатПодп_raw = КС.XDTO_Вычислить(Документ, "Подписант.СтатПодп");
	СтатПодп = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеИзXDTO(СтатПодп_raw);
	
	Должность = КС.XDTO_Вычислить(Документ, "Подписант.Должн");
	Фамилия = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Фамилия");
	Имя = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Имя");
	Отчество = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Отчество");
	
	ЕстьЗамечанияПеревозчика = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьЗамечанияПеревозчикаXDTO(СодИнфПрвПрием);
	ЕстьОтметкиПеревозчика	 = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьОтметкиПеревозчикаXDTO(ОтметПрв);
	
	Если ЕстьЗамечанияПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьЗамечанияПеревозчикаXDTO(СодИнфПрвПрием, ЭтотОбъект, Истина);
	КонецЕсли;
	
	Если ЕстьОтметкиПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьОтметкиПеревозчикаXDTO(ОтметПрв, ЭтотОбъект);
	КонецЕсли;
	
	КонтурЛогистика_КонструкторыXDTO.ЗаполнитьИнфПолИзXDTO(СодИнфПрвПрием, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTOОтказ(Знач XDTO)
	
	ЕстьОтказВПодписи = Истина;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	
	Если Найти(XDTO.ИдФайл, "DP_UVUTOCH") > 0 Тогда
	
		// Данные Подписанта
		XDTO_Подписант 		= КС.XDTO_Вычислить(Документ, "Подписант");
		
		Должность 	= КС.XDTO_Вычислить(XDTO_Подписант, "Должн");
		Фамилия 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Фамилия");
		Имя 		= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Имя");
		Отчество 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Отчество");
			
		ТекстУведомления 		= КонтурЛогистика_КонструкторыXDTO.XDTO_Вычислить(XDTO, "Документ.СвУведУточ.ТекстУведУточ");	
		ПричинаОтказаВПодписи 	= ?(Не ТипЗнч(ТекстУведомления) = Тип("ОбъектXDTO"), ТекстУведомления, "");
		
	Иначе // УС
		
		КС.ЗаполнитьРеквизитыТитулаИзУС(Документ, ПричинаОтказаВПодписи);
				
	КонецЕСли; 
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыДляСледующегоТитула(ПредыдущийТитул);
	
	Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда 
		ДокументОснование = НайденныйДокУчСист;
	КонецЕсли;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ДанныеЗаполнения.ТипЛогистика);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации) Тогда
		ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул, Знач ВходящийФайлТитула1 = Неопределено) Экспорт
	
	// issue/KL-6567
	
	ГлавныйДокумент = ПредыдущийТитул.ДокументЭТРН;
	
	ПоследнийФайлТ2 =  Справочники.КонтурЛогистика_ФайлыОбмена.НайтиПоследнийФайлТитулаПоГлавномуДокументу(		
		ГлавныйДокумент, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2);
		
	Если Не ЗначениеЗаполнено(ПоследнийФайлТ2) Тогда
		// если еще не было ни одного файла обмена Т2 то всегда ссылаемся на исходный Т1	
		
		ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиПервыйФайлТитулаПоГлавномуДокументу(		
			ГлавныйДокумент, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
			
	ИначеЕсли ВходящийФайлТитула1 <> Неопределено Тогда
		// передан конкретный файл Т1
		
		ФайлТитула1 = ВходящийФайлТитула1;
		
	Иначе // уже есть существующие титулы 2
		
		// требуется найти первый Т1 появившийся после последнего существующего Т2
		// берем дату последнего  Т2
			
		ДатаВремяФормированияТ2 = ПоследнийФайлТ2.ДатаВремяФормирования;
		
		// Использовать первый Т1 появившийся после этого времени
		
		ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиПервыйФайлТитулаПоГлавномуДокументу(		
			ГлавныйДокумент, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ДатаВремяФормированияТ2);
			
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ФайлТитула1) Тогда 
		
		ВызватьИсключение "Не удалось найти файл Т1 (Грузоотправителя) на основании которого заполняется Т2";
		
	КонецЕсли;
	
	ИдФайлИнфГО 	= СтрЗаменить(ФайлТитула1.ИмяФайла, ".xml", "");
	
	// взять реквизиты из ФайлТитула1.
	// нельзя брать из ФайлТитула1.ДатаВремяФормирования т.к. это время МСК а мы не знаем в каком поясе было в файле
	XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ФайлТитула1.ТекстXML.Получить());
	ДатФайлИнфГО_raw = КонтурЛогистика_КонструкторыXDTO.XDTO_Вычислить(XDTO, "Документ.ДатИнфГО");
	ВрФайлИнфГО_raw = КонтурЛогистика_КонструкторыXDTO.XDTO_Вычислить(XDTO, "Документ.ВрИнфГО");
	
	ДатФайлИнфГО 	= КонтурЛогистика_КонструкторыXDTO.Конвертировать_ДатаТип_вДата(ДатФайлИнфГО_raw);
	ВрФайлИнфГО 	= КонтурЛогистика_КонструкторыXDTO.Конвертировать_ВремяТип_вДата(ВрФайлИнфГО_raw);
	
	// при этом реквизиты Испр берем из предыдущего титула, они могут не совпадать с файлом т1 - это нормально
	НомИспрГО		= ПредыдущийТитул.НомИспр;
	ДатаИспрГО		= ПредыдущийТитул.ДатаИспр;
	
	ДвоичныеДанныеПодписи = ФайлТитула1.Подпись.Получить();
	ЭПГО = Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЭТРН.Перевозчик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации = Неопределено) Экспорт
	
	Если КонтекстНастройкиКонвертации = Неопределено Тогда
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2);
	КонецЕсли;
	
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул2.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфПрвПрием = ТекущаяДатаСеанса();
		ВрИнфПрвПрием = ТекущаяДатаСеанса();
		
		// формируем текст xml
		Если Не ЕстьОтказВПодписи Тогда 
			РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфПрвПрием, ВрИнфПрвПрием);
		Иначе
			Если КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.ПереходНаУССостоялся(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2) Тогда
				РезультатФормированияТекста = СформироватьТекстФайлаУниверсальногоСообщения();
				ПараметрыФайлаРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
				ПараметрыФайлаРеквизиты.Вставить("КаналТранспорта", Перечисления.КонтурЛогистика_КаналыТранспорта.Диадок);
			Иначе
				РезультатФормированияТекста = СформироватьТекстФайлаУведомленияОбУточнении(ДатИнфПрвПрием, ВрИнфПрвПрием);
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфПрвПрием и ВрИнфПрвПрием
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 2;
	
	Формат = "5.01";
	ТипДокументооборота = "__etrnTitle";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
		ИстинныйГрузоотправитель = ДокументЭТРН.ПогрузкуОсуществляет;
	Иначе
		ИстинныйГрузоотправитель = ДокументЭТРН.Грузоотправитель;
	КонецЕсли;
	
	ДополнительныеПолучателиФайлаОбмена = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДопПолучателейФайла(ДокументЭТРН);
	
	Если ДополнительныеПолучателиФайлаОбмена.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайлаОбмена); 	
		
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ИстинныйГрузоотправитель,
												ДокументЭТРН.Перевозчик,
												ДокументЭТРН.Грузополучатель,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_Подписант(НомерТитула, , Формат, ПодписантСтруктура);
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, , Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_СодИнфПрвПрием = КС.XDTO_СодИнфПрвПрием(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфПрвПрием", XDTO_СодИнфПрвПрием);
	
	XDTO_ИдИнфГО 		= КС.XDTO_ИдИнфГО(НомерТитула, Формат, Ссылка, ТипДокументооборота);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфГО", XDTO_ИдИнфГО);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайлаУведомленияОбУточнении(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 2;
	Формат = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ФорматОбменаУведомленийОбУточнении();
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");

	XDTO_Файл = КС.XDTO_ФайлОбменаУведомлений(Ссылка, ДокументЭТРН, Формат);
	
	// подписант
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант 		= КС.XDTO_ПодписантУведомления( , , ПодписантСтруктура, Неопределено);
	XDTO_Файл.Документ.Подписант = XDTO_Подписант;
	Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	
	GUID = Строка(Новый УникальныйИдентификатор);
			
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаУведомлений(ДокументЭТРН.Грузоотправитель, ДокументЭТРН.Перевозчик, GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
																	
	КС.УдалитьПустыеСвойстваXDTO(XDTO_Файл);
													
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайлаУниверсальногоСообщения()
	
	ЛицоОтпрУС = ДокументЭТРН.Перевозчик;
	ЛицоПолучУС = ДокументЭТРН.Грузоотправитель;
	ТекстУС = ПричинаОтказаВПодписи;
	ИмяПолФайл = ИдФайлИнфГО;
	
	Результат = КонтурЛогистика_КонструкторыXDTO.СформироватьТекстФайлаУниверсальногоСообщения(ЛицоОтпрУС, ЛицоПолучУС, ТекстУС, ИмяПолФайл);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
